<template>
  <div class="policyloan-box">
    <el-collapse v-model="activeName">
      <el-collapse-item class="agree-area" name="1">
        <template slot="title" class="txt-area">
          <i class="el-icon-remove"></i>保險單借款 重要事項告知
        </template>
        <div>
          <ul>
            <li>
              壹、「保險單借款利率」、「借款利息計算方式」及「撥款方式」將於「保險單借款約定事項」中另行約定揭露。
              說明：
            </li>
            <li>
              一、借款人申請借款之金額，以借款當時保險契約之保單價值準備金或保單帳戶價值範圍內為限。
            </li>
            <li>
              二、因各保險商品特性不同，若借款人本次申請借款之金額高於保險公司撥款當時所核定的最高可借額度時，保險公司將以撥款當時所核定的最高可借額度作為本次申請借款之金額上限。
            </li>
            <li>
              三、借款人以自動櫃員機辦理還款，所須自行負擔之費用以跨行轉帳手續費為限。
            </li>
            <li>
              四、依金融監督管理委員會99年8月9日金管銀票字第09900272710號函規定，信用卡發卡機構不得同意持卡人以信用卡作為繳付保險單借款本息之工具，故借款人不得以信用卡繳付保險單借款本金及利息（以下簡稱借款本息）。
            </li>
            <li>
              貳、依據民法第207條規定，借款利息遲付逾一年後，經催告而不償還時，保險公司得將其利息併入借款本金中以複利計算。
            </li>

            <li></li>
            <li>
              說明：
            </li>
            <li>
              一、借款人於借款利息到期日前應自行向保險公司繳付，或在保險公司派員收取時繳付。
            </li>
            二、保單借款利率若因法令或市場變動而有所調整時，保險公司將會於該公司網站或以與借款人約定之方式公開揭露，並自公開揭露之日起按新利率調整計算。
            <li>
              三、保險公司應每年至少一次將保單預定利率、借款本息及利率以與借款人約定之方式通知借款人，並於公司網站或其他方式提供借款人查詢。
            </li>
            <li>
              四、借款人清償保險單借款時，除另有約定外，依民法第323條之規定，清償金額將先抵充費用、其次抵充利息，最後再抵充本金。
            </li>
            <li>
              參、未償還的借款本息於超過保險契約的保單價值準備金或保單帳戶價值時，該保險契約效力將依約停止或即行終止。
            </li>
            <li>
              說明：
            </li>
            <li>
              一、保險公司在保險契約效力停止日前，將依保單條款的約定以書面通知借款人。
            </li>
            <li>
              二、「停效期間」所發生的保險事故，保險公司將不負給付責任。
            </li>
            <li>
              三、保險契約停效後，要保人得部分清償保險單借款本息使契約效力恢復。其未償餘額不得逾保險契約約定之保險單借款可借金額上限。
            </li>
            <li>
              肆、保險單借款未清償前，如保險公司依約有給付各項保險金、年金、解約金、返還保單價值準備金或其他金額時，或保險契約有辦理減額繳清保險、展期定期保險等變更時，保險公司得無須通知借款人，逕先行扣除未償還的借款本息後，就其餘額給付或變更。
            </li>
            <li>
              伍、投保「遞延年金保險」及「利率變動型年金保險」特別權益說明。
              說明：
            </li>
            <li>
              一、借款人應於年金給付開始日前償還借款本息。
            </li>
            <li>
              二、借款人若未償還，保險公司將以當時的保單價值準備金扣除借款本息後，重新計算年金金額，此將可能使受益人原可領得之年金金額減少。
            </li>
            <li>
              陸、保險公司對於借款人所提供的各項基本資料，只能以履行契約為目的之範圍內使用，並應遵照「個人資料保護法」相關規定辦理。
            </li>
          </ul>
        </div>
      </el-collapse-item>
      <el-collapse-item class="agree-area" name="2">
        <template slot="title" class="txt-area">
          <i class="el-icon-remove"></i>保險單借款 約定事項
        </template>
        <div>
          <ul>
            <li>
              一、本借款期間自貴公司給付借款金額日起至本保險契約（以下簡稱「本契約」）消滅時為止（借款人於借款期間亦得隨時清償或部分清償本借款之本息）；本契約為年金保險者，則本借款期間至本契約消滅時或年金開始給付前為止。但本契約約定年金保證期間或貴公司付滿保證金額前得辦理保單借款者不在此限。
            </li>
            <li>
              二、本件借款之利率係衡量保單成本、資金運用效率及保戶權益等因素，年利率依貴公司公告之借款利率為準，如遇法令或市場狀況而有所調整時，貴公司得自公布調整之日起按新利率調整之，並應在貴公司網站或以與借款人約定之方式公開揭露。另貴公司應每年至少一次將保單預定利率、借款本息及利率以與借款人約定之方式通知借款人。
            </li>
            <li>
              三、借款利息每逢保單周年日應付息一次。利息到期日應向貴公司自行繳納，但貴公司派員收取時自當照付。逾期欠繳之利息，遲付逾一年後經催告而不償還時，貴公司得將逾期欠繳之利息併入借款本金中以複利計算。
            </li>
            <li>
              四、清償保險單借款時，清償金額將先抵充費用、其次抵充利息，最後再抵充本金。
            </li>
            <li>
              五、借款未償還前，如貴公司依本契約條款給付各項保險金、年金、解約金、返還保單價值準備金或其他金額，或本契約變更為減額繳清保險、展期定期保險時，貴公司無須通知，得扣除未清償之借款本息。
            </li>
            <li>
              六、借款人不按約定條件付息者，本契約之效力於未償還之借款本息超過保單價值準備金時即行停止，貴公司並應於效力停止日之三十日前以書面通知本人；但本契約為遞延年金保險（或利率變動型年金保險）者，則本契約之效力於未償還之借款本息超過年金保單價值準備金時即行停止（或終止）。本契約因未償還之借款本息超過保單價值準備金停效後，借款人得部分清償保險單借款本息使契約效力恢復。其未償餘額不得逾保險契約約定之保險單借款可借金額上限。
            </li>
            <li>
              七、投保遞延年金或利率變動型年金者，應於年金給付開始日前（若本契約有約定，得於保證期間或保證金額攤提期間辦理借款者，並應於前開期間屆滿時）償還借款本息；若未償還，本公司得就當時保單價值準備金扣除
              借款本息後，重新計算年金金額。
            </li>
            <li>
              八、撥款日為申請日後7個工作日內。
            </li>
            <li>
              九、投保「鑫享退休/增享退休美元變額年金保險」特別權益說明。
              說明：保證提領金額開始給付時，若有未償還保險單借款本息，將先將抵銷借款本息後給付其餘額。
            </li>
            <li>
              十、投保「美元傳統型保險商品」貸款權益說明。
              說明：可借金額上限為借款當日保單價值準備金之80％，商品包含現售及有效契約。
            </li>
            <li>十一、本公司聯絡方式</li>
            <li>
              說明：一、免付費專線：0800-015000/傳真02-27679299
            </li>
            <li>
              二、網址：www.prulife.com.tw
            </li>
          </ul>
        </div>
      </el-collapse-item>
      <el-collapse-item class="agree-area" name="3">
        <template slot="title" class="txt-area">
          <i class="el-icon-remove"></i>注意事項
        </template>
        <div>
          <ul>
            <li>
              借款人(即要保人)已詳細閱讀「保險單借款重要事項告知暨約定事項」，並確實瞭解相關權益及應注意事項。
            </li>
            <li>
              要保人使用本項服務向本公司申請保單借款作業時，若於營業日上午11點以前完成申請，經本公司身分確認及審核無誤後，於當日進行撥款（美元借款為次一營業日撥款）；若超過營業日上午11點後申請完成者，將順延於次一營業日進行撥款（美元借款為申請日次二營業日撥款），實際入帳時間則依各銀行作業而定。本公司於將所申請之借款金額匯入申請人指定之銀行帳戶時，本公司即已完成給付義務之履行。如有非可歸責於本公司之匯款作業錯誤或延宕者，本公司概不負責。
            </li>
            <li>
              為保障您的財務安全，如您當日單張保單借款金額超過新台幣200萬元者，本公司將向您進行身份確認後才進行撥款作業，如影響您的收款時間，請暸解並同意作業之延宕為必須且無異議。
            </li>
            <li>
              保單可借額度可能隨商品特性及保單狀況異動，致無法借得您所申請之金額，本公司將依保單最高可借範圍內調整本次借款金額。
            </li>
            <li>
              四、依金融監督管理委員會99年8月9日金管銀票字第09900272710號函規定，信用卡發卡機構不得同意持卡人以信用卡作為繳付保險單借款本息之工具，故借款人不得以信用卡繳付保險單借款本金及利息（以下簡稱借款本息）。
            </li>
            <li>
              貳、依據民法第207條規定，借款利息遲付逾一年後，經催告而不償還時，保險公司得將其利息併入借款本金中以複利計算。
            </li>

            <li></li>
            <li>
              說明：
            </li>
            <li>
              一、借款人於借款利息到期日前應自行向保險公司繳付，或在保險公司派員收取時繳付。
            </li>
            二、保單借款利率若因法令或市場變動而有所調整時，保險公司將會於該公司網站或以與借款人約定之方式公開揭露，並自公開揭露之日起按新利率調整計算。
            <li>
              三、保險公司應每年至少一次將保單預定利率、借款本息及利率以與借款人約定之方式通知借款人，並於公司網站或其他方式提供借款人查詢。
            </li>
            <li>
              四、借款人清償保險單借款時，除另有約定外，依民法第323條之規定，清償金額將先抵充費用、其次抵充利息，最後再抵充本金。
            </li>
            <li>
              參、未償還的借款本息於超過保險契約的保單價值準備金或保單帳戶價值時，該保險契約效力將依約停止或即行終止。
            </li>
            <li>
              說明：
            </li>
            <li>
              一、保險公司在保險契約效力停止日前，將依保單條款的約定以書面通知借款人。
            </li>
            <li>
              二、「停效期間」所發生的保險事故，保險公司將不負給付責任。
            </li>
            <li>
              三、保險契約停效後，要保人得部分清償保險單借款本息使契約效力恢復。其未償餘額不得逾保險契約約定之保險單借款可借金額上限。
            </li>
            <li>
              肆、保險單借款未清償前，如保險公司依約有給付各項保險金、年金、解約金、返還保單價值準備金或其他金額時，或保險契約有辦理減額繳清保險、展期定期保險等變更時，保險公司得無須通知借款人，逕先行扣除未償還的借款本息後，就其餘額給付或變更。
            </li>
            <li>
              伍、投保「遞延年金保險」及「利率變動型年金保險」特別權益說明。
              說明：
            </li>
            <li>
              一、借款人應於年金給付開始日前償還借款本息。
            </li>
            <li>
              二、借款人若未償還，保險公司將以當時的保單價值準備金扣除借款本息後，重新計算年金金額，此將可能使受益人原可領得之年金金額減少。
            </li>
            <li>
              陸、保險公司對於借款人所提供的各項基本資料，只能以履行契約為目的之範圍內使用，並應遵照「個人資料保護法」相關規定辦理。
            </li>
          </ul>
        </div>
      </el-collapse-item>
    </el-collapse>
    <div class="flex-box">
      <div class="flex-pos">
        <div class="btn-box">
          <el-row type="flex" justify="center">
            <el-col :span="8"> <el-button>取消，下次再變更</el-button></el-col>
            <el-col :span="8">
              <el-button class="top-btn btn-blue no-brd" @click="handleAgree">
                確定，我了解
              </el-button>
            </el-col>
            <el-col :span="8"><el-button>保德信專案貸款資訊</el-button></el-col>
          </el-row>
        </div>
      </div>
    </div>
  </div>
</template>
<script>
export default {
  name: "PolicyLoan_agree",
  data() {
    return {
      activeName: ["1", "2", "3"]
    };
  },
  methods: {
    handleChange(val) {
      console.log(val);
    },
    handleAgree() {
      this.$router.push({ path: "/PolicyLoan_step" });
    }
  }
};
</script>
<style lang="scss" scoped>
.policyloan-box {
  .agree-area {
    box-shadow: 0 0 10px 3px rgba(223, 223, 223, 0.5);
    background-color: #fff;
    border-radius: 10px !important;
    margin-bottom: 1vw;
    i {
      margin-right: 1vw;
      font-size: 22px;
    }
  }
  .btn-box {
    width: 50%;
    margin: 2vw 0;
  }
}
</style>
